# 1. (1б) Пользователь вводит 4 вещественных числа. Вывести на экран
# максимальное из них.
# 2. (1б) Вывести все целые числа от a до b в порядке убывания
# 3. (1б) Пользователь вводит сторону квадрата. Вывести на экран квадрат с
# заданной стороной, заполненный целыми числами с шагом 1, начиная с
# 5, в порядке возрастания.
# 4. (1б) Пользователь вводит символ, определить является ли данный
# символ заглавной латинской буквой.
# 5. (1б) Создать одномерный список размером 8. Заполнить его целыми
# числами начиная от 0, по возрастанию, с шагом 3 (циклом). Вывести
# список на экран.
# 6. (2б) Создать двумерный массив, заполнить его случайными числами в
# диапазоне от a до b (a и b могут быть отрицательными значениями,
# предусмотреть вероятность того, что a больше b). Вывести на экран
# массив и среднее арифметическое всех элементов массива.
# 7. (2б) В предыдущем списке найти наименьшее и наибольшее значение.
# 8. (2б) Напишите функцию, определяющую наличие переданного ей числа
# в одномерном списке целых чисел (не использовать готовый метод).
# 9. (2б) Напишите функцию, возвращающую все нечетные числа
# переданного ей списка.
# 10. (2б) Напишите функцию, которая принимает двумерный список и номер
# столбца. Функция должна возвращать список содержащий элементы в
# указанном столбце двумерного списка.
# 11. (3б) Напишите функцию, возвращающую все числа, присутствующие в
# строке. Числом является самостоятельное числовое значение не
# входящие в состав другого слова.
# 12. (6б) Напишите программу, позволяющую:
# - создавать студента с именем, номером класса и оценками
# - выводить всех студентов из определенного класса
# - удалять студента из списка
# - добавлять студенту оценку
# - выводить всю информацию о студенте
# - выводить всех студентов в виде (номер студента, имя, класс)